//#include<stdio.h>

//int main()
//{
//	//输出常量
//	////1.输出整数
//	//printf("%d",18);
//
//	////2.输出小数
//	//printf("%f", 1.93);
//
//	//3.输出字符
//	//printf("%c",'A');
//
//	//输出字符串
//	//第一种方式：
//	//printf("Hello World");
//	//第二种方式：
//	//printf("我的名字是：%s","Hello World");
//	//printf("我学校的名字是:%s", "安徽大学");
//	//printf("我的高考成绩是:%f分",619.);
//	//printf("我亲亲女朋友的名字是：%s","阿伟");
//	//printf("我亲亲女朋友的名字是：%s。性别：%s。身高：%f米。体重：%d斤。","阿伟","女",18,1.80,110);
//	printf("我亲亲女朋友的名字是：%s\n","阿伟");
//	printf("性别：%s\n","女");
//	printf("年龄：%d岁\n", 18);
//	printf("身高：%f米\n", 1.70);
//	printf("体重：%d斤", 110);
//
//
//	return 0;
//
//}