d = {
    "小张" : {"语文" : 99, "数学" : 88, "英语" : 22},
    "小王" : {"语文" : 88, "数学" : 66, "英语" : 21},
    "小李" : {"语文" : 66, "数学" : 11, "英语" : 33}
}
d["小赵"] = {"语文" : 66, "数学" : 78, "英语" : 62}
print(d)
d["小李"] = {"语文" : 99, "数学" : 98, "英语" : 66}
print(d)
value = d.pop("小赵")
print(d)
print(value)
d.clear()
print(d)
d = {"a" : 1, "b" : 2}
d = {}
print(d)
d = {
    "小张" : {"语文" : 99, "数学" : 88, "英语" : 22},
    "小王" : {"语文" : 88, "数学" : 66, "英语" : 21},
    "小李" : {"语文" : 66, "数学" : 11, "英语" : 33}
}
print(d.keys())
for key in d.keys():
    print(f"{key} : {d[key]}")
for i in d:
    print(f"{i} : {d[i]}")
print(len(d))